"""


[title]: # (Конкатенация и разделение)


Конкатенация и разделение
=========================

Копия подмассива
----------------

    >>> import numpy as np

    >>> np.random.seed(2)
    >>> x = np.random.randint(1, 10, size=(3, 3))
    >>> x
    array([[9, 9, 7],
           [3, 9, 8],
           [3, 2, 6]])

    >>> y = x[:2, :2].copy()
    >>> y
    array([[9, 9],
           [3, 9]])

Reshaping
---------

    >>> x = np.arange(1, 10)
    >>> x
    array([1, 2, 3, 4, 5, 6, 7, 8, 9])

    >>> x.reshape((3, 3))
    array([[1, 2, 3],
           [4, 5, 6],
           [7, 8, 9]])

Конкатенация
------------

    >>> x = np.arange(1, 5)
    >>> x
    array([1, 2, 3, 4])

    >>> y = np.arange(20, 25)
    >>> y
    array([20, 21, 22, 23, 24])

    >>> np.concatenate([x, y])
    array([ 1,  2,  3,  4, 20, 21, 22, 23, 24])

Вертикальный стэк
-----------------

    >>> np.vstack([x, x])
    array([[1, 2, 3, 4],
           [1, 2, 3, 4]])

Горизонтальный стэк
-------------------

    >>> x = np.array([[1, 2, 3], [1, 2, 3]])
    >>> x
    array([[1, 2, 3],
           [1, 2, 3]])
    >>> y = np.array([[4], [4]])
    >>> y
    array([[4],
           [4]])
    >>> z = np.hstack([x, y])
    >>> z
    array([[1, 2, 3, 4],
           [1, 2, 3, 4]])

Разделение массива
------------------

    >>> x = np.arange(10)
    >>> x
    array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])
    >>> x1, x2 = np.split(x, 2)
    >>> x1
    array([0, 1, 2, 3, 4])
    >>> x2
    array([5, 6, 7, 8, 9])

Вертикальное разделение
-----------------------

    >>> x = np.arange(16).reshape((4, 4))
    >>> x
    array([[ 0,  1,  2,  3],
           [ 4,  5,  6,  7],
           [ 8,  9, 10, 11],
           [12, 13, 14, 15]])
    >>> x1, x2 = np.vsplit(x, 2)
    >>> x1
    array([[0, 1, 2, 3],
           [4, 5, 6, 7]])
    >>> x2
    array([[ 8,  9, 10, 11],
           [12, 13, 14, 15]])

Горизонтальное разделение
-------------------------

    >>> a = np.arange(3)
    >>> a
    array([0, 1, 2])
    >>> b = np.arange(4, 7)
    >>> b
    array([4, 5, 6])
    >>> z = np.vstack([a, b])
    >>> z
    array([[0, 1, 2],
           [4, 5, 6]])
    >>> z1, z2 = np.hsplit(z, [2])
    >>> z1
    array([[0, 1],
           [4, 5]])
    >>> z2
    array([[2],
           [6]])


"""
