"""


[title]: # (Срезы массивов)


Срезы массивов
--------------

    >>> import numpy as np

    >>> x = np.arange(10)
    >>> x[0]
    0
    >>> x[::-1]
    array([9, 8, 7, 6, 5, 4, 3, 2, 1, 0])
    >>> x[::2]
    array([0, 2, 4, 6, 8])
    >>> x[::3]
    array([0, 3, 6, 9])
    
    >>> np.random.seed(2)
    >>> x = np.random.randint(10, size=(3, 3))
    >>> x
    array([[8, 8, 6],
           [2, 8, 7],
           [2, 1, 5]])

Чтение строк в массив

    >>> x[0, :]
    array([8, 8, 6])

    >>> x[1, :]
    array([2, 8, 7])

    >>> x[2, :]
    array([2, 1, 5])

Чтение столбцов в массив (Все строки, нулевой столбец)

    >>> x[:, 0]
    array([8, 2, 2])
    
Все строки, 1-ый столбец
    
    >>> x[:, 1]
    array([8, 8, 1])

Все строки, 2-ой столбец

    >>> x[:, 2]
    array([6, 7, 5])

Срез одного столбца (Все строки, 1 столбец)

    >>> x[:, :1]
    array([[8],
           [2],
           [2]])

Срез двух столбцов (Все строки, 2 столбца)

    >>> x[:, :2]
    array([[8, 8],
           [2, 8],
           [2, 1]])

    >>> x[:2, :]
    array([[8, 8, 6],
           [2, 8, 7]])

    >>> x[:2, :2]
    array([[8, 8],
           [2, 8]])


"""


