"""


[title]: # (Broadcasting)


Broadcasting
============

Массивы одинакового размера складываются поэлементно.

    >>> import numpy as np
    >>> a = np.array([1, 2, 3])
    >>> b = np.array([2, 2, 2])
    >>> a + b
    array([3, 4, 5])

Массивы складываются со скаляром поэлементно.

    >>> a + 1
    array([2, 3, 4])

Двумерные массивы складываются со скаляром.

    >>> c = np.array([
    ...     [1, 2, 3],
    ...     [2, 2, 2],
    ...     [3, 2, 1]
    ... ])

    >>> c + 1
    array([[2, 3, 4],
           [3, 3, 3],
           [4, 3, 2]])

При сложениии двумерного массива и одномерного, получается двумерный массив

    >>> a
    array([1, 2, 3])

    >>> m = np.ones((3, 3))
    >>> m
    array([[ 1.,  1.,  1.],
           [ 1.,  1.,  1.],
           [ 1.,  1.,  1.]])
    >>> m + a
    array([[ 2.,  3.,  4.],
           [ 2.,  3.,  4.],
           [ 2.,  3.,  4.]])

Сложение вектора-строки и вектора-столбца

    >>> a = np.arange(3)
    >>> b = np.arange(3)[:, np.newaxis]
    >>> a
    array([0, 1, 2])
    >>> b
    array([[0],
           [1],
           [2]])
    >>> a + b
    array([[0, 1, 2],
           [1, 2, 3],
           [2, 3, 4]])

"""
